### Подключаем пакет

In [1]:
import numpy as np
import pandas as pd
from IPython.display import display

## GroupBy и Agg

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.328983  1.041078
1    a  two  0.078805 -1.107619
2    b  one -1.986075  2.329274
3    b  two -0.725478  1.300909
4    a  one -1.112358  0.150823

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.720671
      two     0.078805
b     one    -1.986075
      two    -0.725478
Name: data1, dtype: float64

In [5]:
means.unstack()

key2       one       two
key1
a    -0.720671  0.078805
b    -1.986075 -0.725478

In [6]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.078805
            2006   -1.986075
Ohio        2005   -0.527230
            2006   -1.112358
Name: data1, dtype: float64

In [7]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.454179  0.028094
b    -1.355777  1.815092

In [8]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.720671  0.595951
     two   0.078805 -1.107619
b    one  -1.986075  2.329274
     two  -0.725478  1.300909

In [9]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [10]:
for name, group in df.groupby('key1'):
    display(name)
    display(group)

'a'

  key1 key2     data1     data2
0    a  one -0.328983  1.041078
1    a  two  0.078805 -1.107619
4    a  one -1.112358  0.150823

'b'

  key1 key2     data1     data2
2    b  one -1.986075  2.329274
3    b  two -0.725478  1.300909

In [11]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    display((k1, k2))
    display(group)

('a', 'one')

  key1 key2     data1     data2
0    a  one -0.328983  1.041078
4    a  one -1.112358  0.150823

('a', 'two')

  key1 key2     data1     data2
1    a  two  0.078805 -1.107619

('b', 'one')

  key1 key2     data1     data2
2    b  one -1.986075  2.329274

('b', 'two')

  key1 key2     data1     data2
3    b  two -0.725478  1.300909

In [12]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one -1.986075  2.329274
3    b  two -0.725478  1.300909

In [13]:
df.dtypes
grouped = df.groupby(df.dtypes, axis=1)

In [14]:
for dtype, group in grouped:
    display(dtype)
    display(group)

dtype('float64')

      data1     data2
0 -0.328983  1.041078
1  0.078805 -1.107619
2 -1.986075  2.329274
3 -0.725478  1.300909
4 -1.112358  0.150823

dtype('O')

  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [15]:
display(df)
df.groupby(['key1', 'key2'])[['data2']].mean()

  key1 key2     data1     data2
0    a  one -0.328983  1.041078
1    a  two  0.078805 -1.107619
2    b  one -1.986075  2.329274
3    b  two -0.725478  1.300909
4    a  one -1.112358  0.150823

              data2
key1 key2
a    one   0.595951
     two  -1.107619
b    one   2.329274
     two   1.300909

In [16]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe    -0.080722 -0.056440  1.605294 -0.212418  0.634917
Steve   0.157078 -1.161406 -0.774681  0.047496 -0.019432
Wes     0.819269       NaN       NaN  2.323468  0.427242
Jim    -0.362294  1.209902  0.379148  0.527656  0.276777
Travis -1.232038 -0.661211 -0.099704 -0.402722 -0.619215

In [17]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [18]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     1.392875  0.497756
Steve  -0.727185 -1.023760
Wes     2.323468  1.246511
Jim     0.906804  1.124385
Travis -0.502427 -2.512463

In [19]:
map_series = pd.Series(mapping)
display(map_series)
people.groupby(map_series, axis=1).count()

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [20]:
display(people)
people.groupby(len).sum()

               a         b         c         d         e
Joe    -0.080722 -0.056440  1.605294 -0.212418  0.634917
Steve   0.157078 -1.161406 -0.774681  0.047496 -0.019432
Wes     0.819269       NaN       NaN  2.323468  0.427242
Jim    -0.362294  1.209902  0.379148  0.527656  0.276777
Travis -1.232038 -0.661211 -0.099704 -0.402722 -0.619215

          a         b         c         d         e
3  0.376253  1.153463  1.984442  2.638705  1.338936
5  0.157078 -1.161406 -0.774681  0.047496 -0.019432
6 -1.232038 -0.661211 -0.099704 -0.402722 -0.619215

In [21]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.080722 -0.056440  1.605294 -0.212418  0.427242
  two -0.362294  1.209902  0.379148  0.527656  0.276777
5 one  0.157078 -1.161406 -0.774681  0.047496 -0.019432
6 two -1.232038 -0.661211 -0.099704 -0.402722 -0.619215

In [22]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      1.217299  1.104077 -2.096229 -0.723520  0.326602
1      0.444184 -1.577526 -0.042506 -0.387040  0.088165
2     -1.678745 -0.557899 -0.901475 -1.217352  0.703405
3      0.975252 -0.644674 -0.135238  0.631391 -0.139355

In [23]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [24]:
display(df)
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

  key1 key2     data1     data2
0    a  one -0.328983  1.041078
1    a  two  0.078805 -1.107619
2    b  one -1.986075  2.329274
3    b  two -0.725478  1.300909
4    a  one -1.112358  0.150823

key1
a   -0.002753
b   -0.851538
Name: data1, dtype: float64

In [25]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.191163  2.148697
b     1.260598  1.028365

In [26]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.454179  0.605370 -1.112358 -0.720671 -0.328983 -0.125089
b      2.0 -1.355777  0.891377 -1.986075 -1.670926 -1.355777 -1.040627

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.078805   3.0  0.028094  1.079593 -1.107619 -0.478398  0.150823
b    -0.725478   2.0  1.815092  0.727164  1.300909  1.558000  1.815092


           75%       max
key1
a     0.595951  1.041078
b     2.072183  2.329274